---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArrayIterator.#ctor
source: html/082ab201-3b7f-3519-0a85-5af9cdb312b7.htm
---
# Autodesk.Revit.DB.CurveArrArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CurveArrArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.